Repository: mspostolov/vkxp
Catalog: translations/*.po
Languages: ru

source: Access token was recieved from vkontakte. Now you may post your nodes there.
ru: Уникальный ключ доступа был получен от сервера vkontakte.ru. Теперь вы можете отправлять туда ваши материалы.

source: Access token was not recieved from vkontakte. Error: !error (!error_description)
ru: Ключ доступа не был получен от сервера vkontakte.ru. Ошибка: !error (!error_description)

source: Access code was not recieved from vkontakte. Error: !error (!error_description)
ru: Код доступа не был получен от сервера vkontakte.ru. Ошибка: !error (!error_description)

source: Enable VKontakte crossposter
ru: Включить VKontakte CrossPoster

source: Main settings
ru: Основные настройки

source: Owner ID
ru: ID владельца

source: Select owner type
ru: Выберите тип владельца

source: Group
ru: Группа

source: User
ru: Пользователь

source: Application ID
ru: ID приложения

source: Application secret code
ru: Секретный код приложения

source: Checkbox "Post this node to vkontakte.ru" are checked by default
ru: Чекбокс "Отправить этот материал вконтакте" включен по умолчанию

source: Check this if you want checkbox "Post this node to vkontakte.ru" in node form was checked by default
ru: Включите этот параметр, если вы хотите чтобы чекбокс "Отправить этот материал вконтакте" на странице добавления/редактирования материала был включен по умолчанию

source: Write from group name
ru: Писать от имени группы

source: Check this if you want to post messages from group name
ru: Выберите этот параметр, если вы хотите, чтобы сообщения отправлялись на стену от имени группы

source: Add link on wall to posted page
ru: Добавлять ссылку на страницу с отправленным материалом

source: Check this if you want to post node url on vk wall
ru: Отметьте этот параметр, если вы хотите, чтобы на стену вконтакте добавлялась ссылка на отправленный материал

source: Save settings
ru: Сохранить настройки

source: The configuration options have been saved.
ru: Настройки были успешно сохранены.

source: Node types
ru: Типы материалов

source: Node types to crosspost
ru: Типы материалов для отправки

source: Messages
ru: Настройки сообщения

source: Message body
ru: Содержимое сообщения

source: Select what to post as wall message
ru: Выберите, что отправлять в качестве сообщения

source: Node title
ru: Заголовок материала

source: Node body
ru: Содержимое материала

source: Node title and node body
ru: Заголовок и содержимое материала

source: Cut message
ru: Обрезать сообщение

source: Cut if message length more than
ru: Обрезать сообщение, если его длина превышает

source: symbols
ru: символов

source: Please, select content types to see their image fiels
ru: Пожалуйста, выберите типы материала, чтобы был доступен выбор их изображений

source: Select amount of images
ru: Выберите количество изображений

source: Amount of images which will be posted to vkontakte.ru
ru: Количество изображений, которые будут прикреплены к сообщению

source: Select imagefield
ru: Выберите поля с изображениями

source: Selected field will be posted with message to vkontakte.ru
ru: Фотографии из выбранного поля будут прикреплены к отправленному сообщению

source: This node types does not contain image fields
ru: Данный тим материала не содержит полей с изображениями

source: You can't post images until !imagefield module is installed.
ru: Вы не можете отправлять изображения, так как модуль !imagefield не установлен

source: Vkontakte CrossPoster module allows users to post nodes automatically to social network vkontakte.ru.
ru: Модуль VKontakte CrossPoster позволяет автоматически отправлять материлы в социальную сеть vkontakte.ru

source: It requires creating standalone application http://vkontakte.ru/editapp?act=create&site=1
ru: Модуль требует создания STANDALONE приложения (сделать это можно здесь http://vkontakte.ru/editapp?act=create&site=1)

source: After creating application you should go to module settings page and put there secret code and application ID
ru: После создания приложения вы должны перейти на страницу настроек модуля и ввести ID приложения, и его секретный ключ

source: Post this node to vkontakte.ru
ru: Отправить этот материал вконтакте

source: You can't crosspost nodes until cURL library is not installed on your server
ru: Вы не можете отправлять сообщения вконтакте, пока не установите библиотеку cURL на ваш сервер

source: Unable to recieve upload server. Error: !error
ru: Невозможно получить сервер для загрузки изображений. Ошибка: !error

source: Node "!title"was successfully posted to vkontakte.ru
ru: Материал "!title" был успешно отправлен вконтакте

source: View
ru: Просмотреть

source: Node was not posted to vkontakte.ru. Error: !error
ru: Материал не был отправлен вконтакте. Ошибка: !error

source: administer vkontakte crossposter
ru: Настраивать модуль VKontakte CrossPoster

source: post to vkontakte
ru: Отправлять материал на сайт vkontakte.ru

source: Node settings
ru: Настройки материалов

source: Images settings
ru: Настройки изображений

source: cURL Support for VKontakte CrossPoster
ru: Поддержка cURL для модуля VKontakte CrossPoster

source: VKontakte CrossPoster requires <a href="http://php.net/manual/en/book.curl.php">cURL support in PHP</a> to function fully. Without this, contents will not be posted to vkontakte.
ru: Модулю VKontakte CrossPoster для работы необходима установленная библиотека<a href="http://php.net/manual/en/book.curl.php"> cURL</a>. Без неё данные не будут отправляться на сайт vkontakte.ru.

source: Allows to send data automatically to vkontakte.ru
ru: Позволяет автоматически отправлять материалы в социальную сеть vkontakte.ru
